In [1]:
import pandas as pd

In [2]:
ab=[
['a','b','c'],['e','f','g'],['h','i','j']
]
pd.DataFrame(ab)

   0  1  2
0  a  b  c
1  e  f  g
2  h  i  j

In [3]:
ab={
'Name':['a','b','c'],'Address':['e','f','g'],'Value':['h','i','j']
}
df=pd.DataFrame(ab)

In [4]:
print(df)

  Name Address Value
0    a       e     h
1    b       f     i
2    c       g     j

In [5]:
df[['Name','Address']]

  Name Address
0    a       e
1    b       f
2    c       g

In [6]:
df['Address']+['  ']+df['Value']

0    e  h
1    f  i
2    g  j
dtype: object

In [7]:
df.iloc[0:2,0:2]

  Name Address
0    a       e
1    b       f

In [8]:
df.head()

  Name Address Value
0    a       e     h
1    b       f     i
2    c       g     j

In [9]:
df.head(3)

  Name Address Value
0    a       e     h
1    b       f     i
2    c       g     j

In [10]:
df.tail(2)

  Name Address Value
1    b       f     i
2    c       g     j

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Address  3 non-null      object
 2   Value    3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [12]:
df.columns

Index(['Name', 'Address', 'Value'], dtype='object')

In [13]:
df.loc[0:2,'Name']

0    a
1    b
2    c
Name: Name, dtype: object

In [14]:
df.shape

(3, 3)

In [15]:
df.shape[0]

3

In [16]:
df['Name']=='a'

0     True
1    False
2    False
Name: Name, dtype: bool

In [17]:
df[df['Name']=='a']

  Name Address Value
0    a       e     h

In [18]:
df['Name'].value_counts()

Name
a    1
b    1
c    1
Name: count, dtype: int64

In [19]:
df['Name'].value_counts().index

Index(['a', 'b', 'c'], dtype='object', name='Name')

In [20]:
df['Name'].value_counts().values

array([1, 1, 1])

In [21]:
df.isna()

    Name  Address  Value
0  False    False  False
1  False    False  False
2  False    False  False

In [22]:
df.isna().sum()

Name       0
Address    0
Value      0
dtype: int64

In [23]:
df.duplicated()

0    False
1    False
2    False
dtype: bool

In [24]:
df.drop_duplicates()

  Name Address Value
0    a       e     h
1    b       f     i
2    c       g     j

In [25]:
df.dropna()

  Name Address Value
0    a       e     h
1    b       f     i
2    c       g     j

In [26]:
df.drop(0,inplace=True)

In [27]:
df.drop('Value',axis=1)

  Name Address
1    b       f
2    c       g

In [28]:
df

  Name Address Value
1    b       f     i
2    c       g     j

In [29]:
df['numeric']=[1,2]

In [30]:
df['numeric'].mean()
df['numeric'].median()
df['numeric'].mode()

0    1
1    2
Name: numeric, dtype: int64

In [31]:
for i in df.columns:
    print(i)

Name
Address
Value
numeric

In [32]:
for i in df.columns:
    print(df[i].mode())

0    b
1    c
Name: Name, dtype: object
0    f
1    g
Name: Address, dtype: object
0    i
1    j
Name: Value, dtype: object
0    1
1    2
Name: numeric, dtype: int64

In [33]:
df['numeric'].quantile(0.25)

np.float64(1.25)

In [34]:
df['numeric'].mean()

np.float64(1.5)

In [35]:
df.dtypes

Name       object
Address    object
Value      object
numeric     int64
dtype: object

In [36]:
import numpy as np

In [37]:
df.index

RangeIndex(start=1, stop=3, step=1)

In [38]:
df.loc[4]=np.array(['a','c','t',4])

In [39]:
df['numeric'].astype(int)

1    1
2    2
4    4
Name: numeric, dtype: int64

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Address  3 non-null      object
 2   Value    3 non-null      object
 3   numeric  3 non-null      object
dtypes: object(4)
memory usage: 120.0+ bytes

In [41]:
df['numeric'].mean()

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [ ]:
df.groupby('Name')["numeric"].mean()

In [ ]:
from sklearn.datasets import iris_load